{"data":{"markdownRemark":{"html":"<div class=\"content has-text-justified\" >\n<p>\nDate: 2017 ~ Present.\n</p>\n<div class=\"columns\">\n    <div class=\"column\"></div>\n    <div class=\"column is-one-thirds\">\n        <div class=\"image\">\n            <a\n            target=\"_blank\"\n            href=\"/images/project/sci/sci_Privacy@Michigan_Presentation_2019_v15.pdf\"\n            rel=\"noopener noreferrer\"\n            >\n                <img src=\"/images/project/sci/sci_Privacy@Michigan_Presentation_2019_v15.jpg\" />\n            </a>\n             <figcaption style=\"text-align: center\">\n                Poster for Privacy@Michigan 2019 - Celebrating International Data Privacy Day\n            </figcaption>\n        </div>\n    </div>\n    <div class=\"column\"></div>\n</div>\n<hr />\n<div class=\"is-size-4 is-size-5-mobile\">Research & Design Strategy</div>\n<br />\n<p>\nThe goal of the research team is to understand the lived experience of patients with neurological impairments such as spinal cord injuries and that of their family members, and clinicians, as such chronic care often time requires assistance from them. We are particularly interested in how members of such care-team collaborate and coordinate with each other with the goal of informing the design of sensor-based technology that can collect data to support such collaboration.\n</p>\n<p>\nThe overall approach for this project is to ground our design based on a solid understanding of care-teams' experiences. We employed multiple methods to understand the care-team members' perspectives and invited a patient to co-design with the research team.</p>\n<p>We started with using semi-structured interviews to obtain team members' experiences of managing or helping to manage the illness and care activity.\n</p>\n<div class=\"image\">\n    <img src=\"/images/project/sci/sci_care_team.png\" />\n    <figcaption style=\"text-align: center\">\n        The care-team of a patient: the patient, family caregivers, paid caregivers, and clinicians\n    </figcaption>\n</div>\n<br />\n<p>\nWith a solid understanding of the way care-team members are collaborating and the challenges they faced currently, we then invoked sketches and other visual materials to introduce the concept of sensor and data. We employed visual materials as tools because our participants might not be familiar with the concept of sensors and data. Therefore, it might be hard for them to provide feedback simply through methods such as interviews that are heavily based on experience. The use of such visual materials helped our participants to reflect on how sensor technology could create a positive impact on their work and the unintended consequence that designers of such technology should be aware of.\n</p>\n<div class=\"columns\">\n    <div class=\"column\">\n        <div class=\"image\">\n            <img src=\"/images/project/sci/sci_data_barchart.jpg\" />\n            <figcaption style=\"text-align: center\">\n            </figcaption>\n        </div>\n    </div>\n    <div class=\"column\">\n        <div class=\"image\">\n            <img src=\"/images/project/sci/sci_data_progressbar.jpg\" />\n            <figcaption style=\"text-align: center\">\n            </figcaption>\n        </div>\n    </div>\n    <div class=\"column\">\n        <div class=\"image\">\n            <img src=\"/images/project/sci/sci_data_five_star.jpg\" />\n            <figcaption style=\"text-align: center\">\n            </figcaption>\n        </div>\n    </div>\n    <div class=\"column\">\n        <div class=\"image\">\n            <img src=\"/images/project/sci/sci_data_checkbox.jpg\" />\n            <figcaption style=\"text-align: center\">\n            </figcaption>\n        </div>\n    </div>\n</div>\n<div  style=\"text-align: center\">\n    Four charts showing different visualization (left to right) highlighting 1) amount, 2) goal and progress, 3) ratings, and 4) a check mark (done it). The charts were used to prompt particiapnts to think about how different data categories and granularity might be useful for monitoring care activities and a patient's health.\n</div>\n<br />\n<div class=\"columns\">\n    <div class=\"column\">\n        <div class=\"image\">\n            <img src=\"/images/project/sci/sci_user_enactment_lofi_1.jpg\" />\n        </div>\n    </div>\n    <div class=\"column\">\n        <div class=\"image\">\n            <img src=\"/images/project/sci/sci_user_enactment_lofi_2.jpg\" />\n        </div>\n    </div>\n</div>\n<div  style=\"text-align: center\">\n    The Lo-Fi prototype was used to gauge users' reaction to systems that would engage after certain care activity had been carried out. The system would (A) report current progress toward goal or (B) recommand a specific plan.\n</div>\n<br />\n<p>\nBy performing thematic analysis on the transcripts and memos, we identified design implications for systems and applications that use sensor data to support care-team collaboration. The two major themes were supporting routinization of care activity and allowing fine-grained control over data to share. For more details, please see the Outcomes section, including publications.\n</p>\n<p>\nTo investigate how fine-grained control can be realistically implemented for regular users without technical training, I employed a co-design process with an undergrad student with a neurological condition for two semesters to design a mobile app for managing the sharing of sensor data. To truly engage the participant as a co-design partner, I designed a short version of the Human-Centered Design curriculum for the participant to get familiar with concepts such as persona and scenario. I invited the participant to be the designer who could bring in his own experience interacting with care-team members to guide the design. Through weekly co-design sessions, I worked with the participant to design a mobile app that allowed a patient to control sensor data collected for and about the patient by regulating data sharing with care-team members.\n</p>\n<div class=\"columns\">\n    <div class=\"column\">\n    </div>\n    <div class=\"column is-half\">\n        <div class=\"image\">\n            <img src=\"/images/project/sci/sci_co-design_whiteboard_paid_primary.jpg\" />\n            <figcaption style=\"text-align: center\">\n               A whiteboard snapshot of our co-design session where my co-design partner and I were discussing, for the same data category, he (partner) might want to have the capability to present data at different levels of details for paid caregivers and the primary caregiver.\n            </figcaption>\n        </div>\n    </div>\n    <div class=\"column\">\n    </div>\n</div>\n<p>As the participant was very passionate about video games, we also explored the possibility of incorporating certain game design elements (e.g., visual) to enrich the expeirence for patients to understand how to control the sharing of their data, in addition to the mobile app. We are currently working on system development to realize such a design.</p>\n</div>\n<hr />\n<div class=\"is-size-4  is-size-5-mobile\">Outcomes</div>\n<div class=\"content has-text-justified\">\n<div class=\"is-size-5  is-size-6-mobile\">Findings & Implications</div>\n<p>\nBy engaging with our participants through various approaches, my team and I have identified two key aspects that designers should consider. First, care activities (e.g., drinking waters and doing bowel program) are being routinized continuously for patients and care-team members to provide stability of care. Sensor-based technology should tailor user engagement with different levels of proactiveness based on the stage of routinization to provide the necessary support to care-teams.\n</p>\n<div class=\"image\">\n    <img src=\"/images/project/sci/sci_tracking_routinization.png\" />\n    <figcaption style=\"text-align: center\">\n        Sensor-based technology to support chronic care should tailor automatic and manual tracking based on difference phases of routinization of care activities to properly support the patient and the care-team as a whole.\n    </figcaption>\n</div>\n<br />\n<p>\nSecond, patients desire to gain independence progressively within a complex and ever-changing care-team. Patients want to control their lives but are not familiar with the nature of sensor data. Sensor-based technology should allow fine-grained control over data being shared to different care-team members and provide support for patients to jump-start and understand the data sharing process. At the same time. as health, care-team, and hence the care evolve, care-team members will need a certain level of autonomy to access data so as to support their work effectively. Sensor-based technology should allow data sharing to be continuously negotiated among care-team members.\n</p>\n<div class=\"image\">\n    <img src=\"/images/project/sci/sci_fine_negotiation.png\" />\n    <figcaption style=\"text-align: center\">\n        Sensor-based technology to support chronic care should support continuous negotiation of fine-grained data sharing to appropriately support the development of independence within an ever-changing care-team, whose members have different experience and expertise.\n    </figcaption>\n</div>\n<br />\n<div class=\"is-size-5  is-size-6-mobile\">Systems & Applications</div>\n<p>\nA backend server was developed to support the interpretation and enforcement of sharing decisions. A web application using a board-game metaphor such as Checkers was developed to support fine-grained control. We conducted a between-subject study to compare our design with another state-of-the-art design proposed by fellow researchers. The manuscript documenting the design process, study, and analysis is currently under review.\n</p>\n</div>\n<div class=\"is-hidden\">\n<p>A mobile prototype was develooped to demonstrate the idea of allowing patients to customize how to track different data using different input controls (e.g., a text field, a slider, or a button set).</p>\n<p>(showing the customization of mobile app? or the mobile app itself? )\n<a href=\"https://docs.google.com/presentation/d/1SlemPpdFDhZRWyWINc17Byb-wjhPme9fkc4VPaXrTf4/edit#slide=id.g21befb6e70_0_70\">https://docs.google.com/presentation/d/1SlemPpdFDhZRWyWINc17Byb-wjhPme9fkc4VPaXrTf4/edit#slide=id.g21befb6e70<em>0</em>70</a></p>\n<p>(a diagram that plot the system architecture? -> but I haven't published? Maybe just some component diagram?)</p>\n<p>(sensor table)</p>\n<div class=\"is-size-4\">Background & Problems</div>\nBeing seriously injured with physical disabilities, such as spinal cord injuries, imposes sudden and significant changes on people's lives. Making the transition from the hospital to home is a daunting process as various aspects of people's lives have to be conducted in drastically different ways due to the severe injuries, not to mention losing the constant support and guidances from trained health professionals at the hospital. Moreover, due to the loss of physical abilities and senses, there are extra procedures (e.g., monitoring hydration and doing pressure relief) needed to be incorporated into individuals' lives to maintain a healthy status.\n<div class=\"is-size-4\">Findings and Outcome</div>\nBased on the findings from interviews and focus group, we argue that Internet of Things (IoT) offer great potentials to support the care team (e.g., individuals, personal assistants, caregivers, and clinicians) in this transition process as individuals naturally interact with everyday objects in various required activities. In this project, we seek to explore specific dimensions in the IoT design space, including user control, modality, and information sharing to design sensor-based mobile platforms and tools for supporting the care team in its on-going effort to create, revise, and recreate these routines that need to be integrated into daily lives to achieve desired outcomes (i.e., staying healthy).\n</div>","frontmatter":{"title":"Support Informal Care Team Collaboration","date":"2017-08-21","keywords":["Human-Computer Interaction","Computer-Supported Cooperative Work","CSCW","HCI","user experience","UX","care","team","spinal cord injury","health","interview","co-design","patient","caregiver","clinician","awareness","collaboration"],"project_tag":"sci"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/care-team-collaboration/"}}